       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCMED-TEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MY-ELEMENTS           PIC 9(3)        OCCURS 10 TIMES.
       01 EXPECTED-AVERAGE       PIC 9(6)V9(2).
       01 ACTUAL-AVERAGE         PIC 9(6)V9(2).
       PROCEDURE DIVISION.
           MOVE 50 TO MY-ELEMENTS(1)
           MOVE 60 TO MY-ELEMENTS(2)
           MOVE 70 TO MY-ELEMENTS(3)
           MOVE 80 TO MY-ELEMENTS(4)
           MOVE 90 TO MY-ELEMENTS(5)
           MOVE 100 TO MY-ELEMENTS(6)
           MOVE 110 TO MY-ELEMENTS(7)
           MOVE 120 TO MY-ELEMENTS(8)
           MOVE 130 TO MY-ELEMENTS(9)
           MOVE 140 TO MY-ELEMENTS(10)
           CALL 'CALCMED'
           STOP RUN.
